RoodsBurger/brushless_lamp/s3/test_ble_arduino/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# CONFIG_SPIRAM is not set

CONFIG_LOG_DEFAULT_LEVEL_WARN=y
# CONFIG_LOG_DEFAULT_LEVEL_INFO is not set
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_CTRL_PINNED_TO_CORE_0=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE_0=y

CONFIG_ESP_WIFI_ENABLED=y

## Larger main task stack (arduino-esp32 init pushes more onto the main stack
## than pure-IDF init).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

## arduino-esp32's default USB-CDC setup needs the legacy driver style — no
## TinyUSB CDC, just USB-Serial-JTAG.
CONFIG_TINYUSB_ENABLED=n

## arduino-esp32 requires this.
CONFIG_FREERTOS_HZ=1000
